<a href="https://colab.research.google.com/github/Shambhavi-Gupta/DS_Missing_Data_With_Pandas/blob/master/DS_Missing_Data_With_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
df = pd.read_csv('rooms.csv')

In [ ]:
df.head()

   Room_Number Num_Students  Department Occupied
0        101.0            1  Mechanical        Y
1        102.0          NaN       Empty        N
2        103.0            3  Electrical        Y
3        104.0            2  Mechanical        Y
4        105.0          NaN    Chemical        N

In [ ]:
df.dtypes

Room_Number     float64
Num_Students     object
Department       object
Occupied         object
dtype: object

In [ ]:
%timeit np.arange(100000 , dtype="int").sum()

The slowest run took 4.18 times longer than the fastest. This could mean that an intermediate result is being cached.
1000 loops, best of 3: 260 Âµs per loop

In [ ]:
%timeit np.arange(100000 , dtype="object").sum()

100 loops, best of 3: 6.19 ms per loop

In [ ]:
df.Room_Number.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: Room_Number, dtype: bool

In [ ]:
df.Room_Number.isnull().sum()

1

In [ ]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True       False     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False     False
7        False          True       False     False
8        False         False       False      True
9        False         False       False     False

In [ ]:
df.isnull().sum()

Room_Number     1
Num_Students    3
Department      0
Occupied        1
dtype: int64

In [ ]:
missing_values = ["NA" , "n/a" , "na"]

In [ ]:
df = pd.read_csv('rooms.csv', na_values= missing_values)

In [ ]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True       False     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False     False
7        False          True       False     False
8        False          True       False      True
9        False         False       False     False

In [ ]:
df.Num_Students.sum()

12.0

In [ ]:
df.Num_Students.mean()

2.0

In [ ]:
missing_values = ["NA" , "n/a" , "na" , "Empty" , "-"]

In [ ]:
df = pd.read_csv('rooms.csv', na_values= missing_values)

In [ ]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True        True     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False      True
7        False          True       False     False
8        False          True       False      True
9        False         False       False     False

In [ ]:
df.Occupied.fillna("N", inplace = True)

In [ ]:
df

   Room_Number  Num_Students  Department Occupied
0        101.0           1.0  Mechanical        Y
1        102.0           NaN         NaN        N
2        103.0           3.0  Electrical        Y
3        104.0           2.0  Mechanical        Y
4        105.0           NaN    Chemical        N
5          NaN           1.0  Electrical        Y
6        107.0           3.0       Civil        N
7        108.0           NaN          CS        Y
8        109.0           NaN  Mechanical        N
9        110.0           2.0          CS        N

In [ ]:
def convert_to_binary(v):
    if v == 'Y':
        return True
    else:
        return False

In [ ]:
df.Occupied = df.Occupied.apply(convert_to_binary)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied
0        101.0           1.0  Mechanical      True
1        102.0           NaN         NaN     False
2        103.0           3.0  Electrical      True
3        104.0           2.0  Mechanical      True
4        105.0           NaN    Chemical     False
5          NaN           1.0  Electrical      True
6        107.0           3.0       Civil     False
7        108.0           NaN          CS      True
8        109.0           NaN  Mechanical     False
9        110.0           2.0          CS     False

In [ ]:
df["Dept2"] = df.Department

In [ ]:
df.Department.fillna(method = "ffill", inplace =True)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           NaN  Mechanical     False         NaN
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           NaN    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           NaN          CS      True          CS
8        109.0           NaN  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

In [ ]:
df.Num_Students.fillna(df.Num_Students.median(), inplace =True)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           2.0  Mechanical     False         NaN
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           2.0    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           2.0          CS      True          CS
8        109.0           2.0  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

In [ ]:
df.Room_Number.interpolate(inplace =True)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           2.0  Mechanical     False         NaN
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           2.0    Chemical     False    Chemical
5        106.0           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           2.0          CS      True          CS
8        109.0           2.0  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS